ZigEmbeddedGroup/texasinstruments-data/ccs_base/common/targetdb/Modules/msp/mspm0l210x/FLASHCTL_1.0.xml
    <register id="FLASHCTL_CMDDATAECC0" width="32" offset="0x11B0" description="Command Data Register ECC 0">
        <bitfield id="VAL0" description="ECC data for bits 63:0 of the data is placed here." begin="7" end="0" width="8" rwaccess="R/W">
            <bitenum id="MINIMUM" value="0x0" description="Minimum value"/>
            <bitenum id="MAXIMUM" value="0xFF" description="Maximum value"/>
        </bitfield>
    </register>
    <register id="FLASHCTL_CMDWEPROTB" width="32" offset="0x11D4" description="Command Write Erase Protect B Register">
        <bitfield id="VAL" description="Each bit protects a group of 8 sectors.  When a bit is 1, the associated 8 sectors
in the flash will be protected from program and erase.  A maximum of 256
sectors can be protected with this register." begin="3" end="0" width="4" rwaccess="R/W">
            <bitenum id="MINIMUM" value="0x0" description="Minimum value of [VAL]"/>
            <bitenum id="MAXIMUM" value="0xFFFFFFFF" description="Maximum value of [VAL]"/>
        </bitfield>
    </register>
    <register id="FLASHCTL_CMDWEPROTNM" width="32" offset="0x1210" description="Command Write Erase Protect Non-Main Register">
        <bitfield id="VAL" description="Each bit protects 1 sector.

bit [0]:	When 1, sector 0 of the non-main region will be protected from program
		and erase.
bit [1]:	When 1, sector 1 of the non-main region will be protected from program
		and erase.
	:
	:
bit [31]:	When 1, sector 31 of the non-main will be protected from program
		and erase." begin="1" end="0" width="2" rwaccess="R/W">
            <bitenum id="MINIMUM" value="0x0" description="Minimum value of [VAL]"/>
            <bitenum id="MAXIMUM" value="0xFFFFFFFF" description="Maximum value of [VAL]"/>
        </bitfield>
    </register>
    <register id="FLASHCTL_CMDWEPROTTR" width="32" offset="0x1214" description="Command Write Erase Protect Trim Register">
        <bitfield id="VAL" description="Each bit protects 1 sector.

bit [0]:	When 1, sector 0 of the engr region will be protected from program
		and erase.
bit [1]:	When 1, sector 1 of the engr region will be protected from program
		and erase.
	:
	:
bit [31]:	When 1, sector 31 of the engr region will be protected from program
		and erase." begin="0" end="0" width="1" rwaccess="R/W">
            <bitenum id="MINIMUM" value="0x0" description="Minimum value of [VAL]"/>
            <bitenum id="MAXIMUM" value="0xFFFFFFFF" description="Maximum value of [VAL]"/>
        </bitfield>
    </register>
    <register id="FLASHCTL_CFGCMD" width="32" offset="0x13B0" description="Command Configuration Register">
        <bitfield id="WAITSTATE" description="Wait State setting for verify reads" begin="3" end="0" width="4" rwaccess="R/W">
            <bitenum id="MINIMUM" value="0x0" description="Minimum value"/>
            <bitenum id="MAXIMUM" value="0xF" description="Maximum value"/>
        </bitfield>
    </register>
    <register id="FLASHCTL_CFGPCNT" width="32" offset="0x13B4" description="Pulse Counter Configuration Register">
        <bitfield id="MAXPCNTOVR" description="Override hard-wired maximum pulse count.  If MAXERSPCNTOVR
is not set, then setting this value alone will override the max pulse count for
both program and erase.  If MAXERSPCNTOVR is set, then this bit will only
control the max pulse count setting for program.
By default, this bit is 0, and a hard-wired max pulse count is used." begin="0" end="0" width="1" rwaccess="R/W">
            <bitenum id="DEFAULT" value="0x0" description="Use hard-wired (default) value for maximum pulse count"/>
            <bitenum id="OVERRIDE" value="0x1" description="Use value from MAXPCNTVAL field as maximum puse count"/>
        </bitfield>
        <bitfield id="MAXPCNTVAL" description="Override maximum pulse counter with this value.  
If MAXPCNTOVR = 0, then this field is ignored.
If MAXPCNTOVR = 1 and MAXERSPCNTOVR = 0, then this value will be used 
to override the max pulse count for both program and erase.  Full max value
will be {4'h0, MAXPCNTVAL} .
If MAXPCNTOVR = 1 and MAXERSPCNTOVR = 1, then this value will be used
to override the max pulse count for program only.  Full max value will be
{4'h0, MAXPCNTVAL}." begin="11" end="4" width="8" rwaccess="R/W">
            <bitenum id="MINIMUM" value="0x0" description="Minimum value"/>
            <bitenum id="MAXIMUM" value="0xFF" description="Maximum value"/>
        </bitfield>
    </register>
    <register id="FLASHCTL_STATCMD" width="32" offset="0x13D0" description="Command Status Register">
        <bitfield id="CMDDONE" description="Command Done" begin="0" end="0" width="1" rwaccess="R">
            <bitenum id="STATNOTDONE" value="0x0" description="Not Done"/>
            <bitenum id="STATDONE" value="0x1" description="Done"/>
        </bitfield>
        <bitfield id="CMDPASS" description="Command Pass - valid when CMD_DONE field is 1" begin="1" end="1" width="1" rwaccess="R">
            <bitenum id="STATFAIL" value="0x0" description="Fail"/>
            <bitenum id="STATPASS" value="0x1" description="Pass"/>
        </bitfield>
        <bitfield id="CMDINPROGRESS" description="Command In Progress" begin="2" end="2" width="1" rwaccess="R">
            <bitenum id="STATCOMPLETE" value="0x0" description="Complete"/>
            <bitenum id="STATINPROGRESS" value="0x1" description="In Progress"/>
        </bitfield>
        <bitfield id="FAILWEPROT" description="Command failed due to Write/Erase Protect Sector Violation" begin="4" end="4" width="1" rwaccess="R">
            <bitenum id="STATNOFAIL" value="0x0" description="No Fail"/>
            <bitenum id="STATFAIL" value="0x1" description="Fail"/>
        </bitfield>
        <bitfield id="FAILVERIFY" description="Command failed due to verify error" begin="5" end="5" width="1" rwaccess="R">
            <bitenum id="STATNOFAIL" value="0x0" description="No Fail"/>
            <bitenum id="STATFAIL" value="0x1" description="Fail"/>
        </bitfield>
        <bitfield id="FAILMISC" description="Command failed due to error other than write/erase protect violation or verify
error.  This is an extra bit in case a new failure mechanism is added which
requires a status bit." begin="12" end="12" width="1" rwaccess="R">
            <bitenum id="STATNOFAIL" value="0x0" description="No Fail"/>
            <bitenum id="STATFAIL" value="0x1" description="Fail"/>
        </bitfield>
        <bitfield id="FAILILLADDR" description="Command failed due to the use of an illegal address" begin="6" end="6" width="1" rwaccess="R">
            <bitenum id="STATNOFAIL" value="0x0" description="No Fail"/>
            <bitenum id="STATFAIL" value="0x1" description="Fail"/>
        </bitfield>
        <bitfield id="FAILMODE" description="Command failed because a bank has been set to a mode other than READ.
Program and Erase commands cannot be initiated unless all banks are in READ
mode." begin="7" end="7" width="1" rwaccess="R">
            <bitenum id="STATNOFAIL" value="0x0" description="No Fail"/>
            <bitenum id="STATFAIL" value="0x1" description="Fail"/>
        </bitfield>
        <bitfield id="FAILINVDATA" description="Program command failed because an attempt was made to program a stored
0 value to a 1." begin="8" end="8" width="1" rwaccess="R">
            <bitenum id="STATNOFAIL" value="0x0" description="No Fail"/>
            <bitenum id="STATFAIL" value="0x1" description="Fail"/>
        </bitfield>
    </register>
    <register id="FLASHCTL_STATADDR" width="32" offset="0x13D4" description="Address Status Register">
        <bitfield id="BANKADDR" description="Current Bank Address
A bank offset address is stored in this register." begin="15" end="0" width="16" rwaccess="R">
            <bitenum id="MINIMUM" value="0x0" description="Minimum value"/>
            <bitenum id="MAXIMUM" value="0xFFFF" description="Maximum value"/>
        </bitfield>
        <bitfield id="BANKID" description="Current Bank ID
A bank indicator is stored in this register which represents the current bank on
which the state  machine is operating.  There is 1 bit per bank." begin="25" end="21" width="5" rwaccess="R">
            <bitenum id="BANK0" value="0x1" description="Bank 0"/>
            <bitenum id="BANK1" value="0x2" description="Bank 1"/>
            <bitenum id="BANK2" value="0x4" description="Bank 2"/>
            <bitenum id="BANK3" value="0x8" description="Bank 3"/>
            <bitenum id="BANK4" value="0x10" description="Bank 4"/>
        </bitfield>
        <bitfield id="REGIONID" description="Current Region ID
A region indicator is stored in this register which represents the current flash 
region on which the state  machine is operating." begin="20" end="16" width="5" rwaccess="R">
            <bitenum id="MAIN" value="0x1" description="Main Region"/>
            <bitenum id="NONMAIN" value="0x2" description="Non-Main Region"/>
            <bitenum id="TRIM" value="0x4" description="Trim Region"/>
            <bitenum id="ENGR" value="0x8" description="Engr Region"/>
        </bitfield>
    </register>
    <register id="FLASHCTL_STATPCNT" width="32" offset="0x13D8" description="Pulse Count Status Register">
        <bitfield id="PULSECNT" description="Current Pulse Counter Value" begin="11" end="0" width="12" rwaccess="R">
            <bitenum id="MINIMUM" value="0x0" description="Minimum value"/>
            <bitenum id="MAXIMUM" value="0xFFF" description="Maximum value"/>
        </bitfield>
    </register>
    <register id="FLASHCTL_STATMODE" width="32" offset="0x13DC" description="Mode Status Register">
        <bitfield id="BANKNOTINRD" description="Bank not in read mode.
Indicates which banks are not in READ mode.  There is 1 bit per bank." begin="0" end="0" width="1" rwaccess="R">
            <bitenum id="BANK0" value="0x1" description="Bank 0"/>
            <bitenum id="BANK1" value="0x2" description="Bank 1"/>
            <bitenum id="BANK2" value="0x4" description="Bank 2"/>
            <bitenum id="BANK3" value="0x8" description="Bank 3"/>
            <bitenum id="BANK4" value="0x10" description="Bank 4"/>
        </bitfield>
        <bitfield id="BANKMODE" description="Indicates mode of bank(s) that are not in READ mode" begin="11" end="8" width="4" rwaccess="R">
            <bitenum id="READ" value="0x0" description="Read Mode"/>
            <bitenum id="RDMARG0" value="0x2" description="Read Margin 0 Mode"/>
            <bitenum id="RDMARG1" value="0x4" description="Read Margin 1 Mode"/>
            <bitenum id="RDMARG0B" value="0x6" description="Read Margin 0B Mode"/>
            <bitenum id="RDMARG1B" value="0x7" description="Read Margin 1B Mode"/>
            <bitenum id="PGMVER" value="0x9" description="Program Verify Mode"/>
            <bitenum id="PGMSW" value="0xA" description="Program Single Word"/>
            <bitenum id="ERASEVER" value="0xB" description="Erase Verify Mode"/>
            <bitenum id="ERASESECT" value="0xC" description="Erase Sector"/>
            <bitenum id="PGMMW" value="0xE" description="Program Multiple Word"/>
            <bitenum id="ERASEBNK" value="0xF" description="Erase Bank"/>
        </bitfield>
        <bitfield id="BANK2TRDY" description="Bank 2T Ready.
Bank(s) are ready for 2T access.  This is accomplished when the pump has
fully driven power rails to the bank(s)." begin="16" end="16" width="1" rwaccess="R">
            <bitenum id="FALSE" value="0x0" description="Not ready"/>
            <bitenum id="TRUE" value="0x1" description="Ready"/>
        </bitfield>
        <bitfield id="BANK1TRDY" description="Bank 1T Ready.
Bank(s) are ready for 1T access.  This is accomplished when the bank and pump
have been trimmed." begin="17" end="17" width="1" rwaccess="R">
            <bitenum id="FALSE" value="0x0" description="Not ready"/>
            <bitenum id="TRUE" value="0x1" description="Ready"/>
        </bitfield>
    </register>
